Repository: muhiro12/Normle
Catalog: Normle/Resources/Localizable.xcstrings
Source language: en
Languages: es, fr, ja, zh_hans

source: Add
es: Añadir
fr: Ajouter
ja: 追加
zh_hans: 添加

source: AI response to restore
es: Respuesta de IA para restaurar
fr: Réponse de l'IA pour restaurer
ja: 復元用のAI応答
zh_hans: 用于恢复的 AI 响应

source: Append new
es: Agregar nuevos
fr: Ajouter les nouvelles
ja: 新規を追加
zh_hans: 追加新项

source: Applied first.
es: Se aplica primero.
fr: Applique en premier.
ja: 最初に適用
zh_hans: 最先应用。

source: Cancel
es: Cancelar
fr: Annuler
ja: キャンセル
zh_hans: 取消

source: Clear
es: Borrar
fr: Effacer
ja: クリア
zh_hans: 清除

source: Clear image
es: Borrar imagen
fr: Effacer l'image
ja: 画像をクリア
zh_hans: 清除图像

source: Copy
es: Copiar
fr: Copier
ja: コピー
zh_hans: 复制

source: Create
es: Crear
fr: Créer
ja: 作成
zh_hans: 创建

source: Create a mapping to get started.
es: Crea un mapeo para empezar.
fr: Créez une correspondance pour commencer.
ja: マッピングを作成して始めましょう。
zh_hans: 创建映射以开始。

source: Create mapping
es: Crear mapeo
fr: Créer une correspondance
ja: マッピングを作成
zh_hans: 创建映射

source: Create mapping from selection
es: Crear mapeo a partir de la selección
fr: Créer une correspondance à partir de la sélection
ja: 選択範囲からマッピングを作成
zh_hans: 从所选内容创建映射

source: Created at
es: Fecha de creación
fr: Date de création
ja: 作成日時
zh_hans: 创建时间

source: Custom
es: Personalizado
fr: Personnalisé
ja: カスタム
zh_hans: 自定义

source: Data
es: Datos
fr: Donnees
ja: データ
zh_hans: 数据

source: Delete
es: Eliminar
fr: Supprimer
ja: 削除
zh_hans: 删除

source: Delete All
es: Eliminar todo
fr: Tout supprimer
ja: すべて削除
zh_hans: 全部删除

source: Delete all history
es: Eliminar todo el historial
fr: Supprimer tout l'historique
ja: 履歴をすべて削除
zh_hans: 删除所有历史记录

source: Delete all history?
es: Eliminar todo el historial?
fr: Supprimer tout l'historique ?
ja: 履歴をすべて削除しますか？
zh_hans: 删除所有历史记录？

source: Delete all records?
es: Eliminar todos los registros?
fr: Supprimer tous les enregistrements ?
ja: すべての記録を削除しますか？
zh_hans: 删除所有记录？

source: Disabled
es: Desactivado
fr: Désactivé
ja: 無効
zh_hans: 已禁用

source: Done
es: Listo
fr: Terminé
ja: 完了
zh_hans: 完成

source: Drop an image or select a file.
es: Suelta una imagen o selecciona un archivo.
fr: Déposez une image ou sélectionnez un fichier.
ja: 画像をドロップするかファイルを選択してください。
zh_hans: 拖放图像或选择文件。

source: Drop or choose a QR image to decode.
es: Suelta o elige una imagen QR para decodificarla.
fr: Déposez ou choisissez une image QR à décoder.
ja: QR画像をドロップするか選択して読み取ります。
zh_hans: 拖放或选择要解码的二维码图像。

source: Edit
es: Editar
fr: Modifier
ja: 編集
zh_hans: 编辑

source: Edit Mapping
es: Editar mapeo
fr: Modifier la correspondance
ja: マッピングを編集
zh_hans: 编辑映射

source: Enabled
es: Activado
fr: Active
ja: 有効
zh_hans: 已启用

source: Enter text, then run QR Encode.
es: Introduce texto y luego ejecuta QR Encode.
fr: Saisissez du texte, puis lancez QR Encode.
ja: テキストを入力してQRエンコードを実行してください。
zh_hans: 输入文本，然后运行 QR Encode。

source: Export
es: Exportar
fr: Exporter
ja: 書き出し
zh_hans: 导出

source: History
es: Historial
fr: Historique
ja: 履歴
zh_hans: 历史记录

source: Import
es: Importar
fr: Importer
ja: 読み込み
zh_hans: 导入

source: Import completed
es: Importación completada
fr: Importation terminée
ja: 読み込みが完了しました
zh_hans: 导入完成

source: Import mappings
es: Importar mapeos
fr: Importer des correspondances
ja: マッピングを読み込み
zh_hans: 导入映射

source: Input
es: Entrada
fr: Entrée
ja: 入力
zh_hans: 输入

source: Inserted: %d
es: Insertados: %d
fr: Ajoutés : %d
ja: 追加: %d
zh_hans: 已添加：%d

source: Kind
es: Tipo
fr: Type
ja: 種類
zh_hans: 类型

source: Manage your subscription and sync preferences.
es: Gestiona tu suscripción y las preferencias de sincronización.
fr: Gérez votre abonnement et vos préférences de synchronisation.
ja: サブスクリプションと同期設定を管理します。
zh_hans: 管理订阅和同步偏好设置。

source: Mapping Detail
es: Detalle del mapeo
fr: Détail de la correspondance
ja: マッピング詳細
zh_hans: 映射详情

source: mappings
es: mapeos
fr: correspondances
ja: マッピング
zh_hans: 映射

source: Mappings
es: Mapeos
fr: Correspondances
ja: マッピング
zh_hans: 映射

source: Mask emails
es: Enmascarar correos electrónicos
fr: Masquer les e-mails
ja: メールアドレスをマスク
zh_hans: 屏蔽电子邮件

source: Mask phone numbers
es: Enmascarar números de teléfono
fr: Masquer les numéros de téléphone
ja: 電話番号をマスク
zh_hans: 屏蔽电话号码

source: Mask URLs
es: Enmascarar URL
fr: Masquer les URL
ja: URLをマスク
zh_hans: 屏蔽 URL

source: Masking Options
es: Opciones de enmascarado
fr: Options de masquage
ja: マスキング設定
zh_hans: 屏蔽选项

source: Merge existing
es: Combinar existentes
fr: Fusionner l'existant
ja: 既存と統合
zh_hans: 合并现有项

source: More
es: Más
fr: Plus
ja: その他
zh_hans: 更多

source: New Mapping
es: Nuevo mapeo
fr: Nouvelle correspondance
ja: 新規マッピング
zh_hans: 新建映射

source: No explicit mappings were stored. Restore falls back to source and target text.
es: No se guardaron mapeos explícitos. La restauración usa el texto de origen y de destino.
fr: Aucune correspondance explicite n'a été enregistrée. La restauration utilise le texte source et cible.
ja: 明示的なマッピングは保存されていません。復元時はソーステキストとターゲットテキストをそのまま使用します。
zh_hans: 未保存显式映射。恢复时将退回使用源文本和目标文本。

source: No History
es: No hay historial
fr: Aucun historique
ja: 履歴がありません
zh_hans: 无历史记录

source: No Mappings
es: No hay mapeos
fr: Aucune correspondance
ja: マッピングがありません
zh_hans: 无映射

source: No QR Code
es: No hay código QR
fr: Aucun code QR
ja: QRコードがありません
zh_hans: 无二维码

source: No Result
es: Sin resultado
fr: Aucun résultat
ja: 結果がありません
zh_hans: 无结果

source: None
es: Ninguno
fr: Aucun
ja: なし
zh_hans: 无

source: Not set
es: Sin establecer
fr: Non défini
ja: 未設定
zh_hans: 未设置

source: OK
es: Aceptar
fr: D'accord
zh_hans: 确定

source: Paste
es: Pegar
fr: Coller
ja: 貼り付け
zh_hans: 粘贴

source: Paste or type text to transform. You can also select text to create a mapping.
es: Pega o escribe el texto que quieres transformar. También puedes seleccionar texto para crear un mapeo.
fr: Collez ou saisissez le texte à transformer. Vous pouvez aussi sélectionner du texte pour créer une correspondance.
ja: テキストを貼り付けるか入力してください。選択範囲からマッピングも作成できます。
zh_hans: 粘贴或输入要转换的文本。你也可以选择文本来创建映射。

source: Presets
es: Ajustes predefinidos
fr: Préréglages
ja: プリセット
zh_hans: 预设

source: QR Image
es: Imagen QR
fr: Image QR
ja: QR画像
zh_hans: 二维码图像

source: Replace all
es: Reemplazar todo
fr: Tout remplacer
ja: すべて置換
zh_hans: 全部替换

source: Restore
es: Restaurar
fr: Restaurer
ja: 復元
zh_hans: 恢复

source: Restore with this record
es: Restaurar con este registro
fr: Restaurer avec cet enregistrement
ja: この記録で復元
zh_hans: 使用此记录恢复

source: Restored text
es: Texto restaurado
fr: Texte restauré
ja: 復元されたテキスト
zh_hans: 已恢复文本

source: Result
es: Resultado
fr: Résultat
ja: 結果
zh_hans: 结果

source: Run a transform to see it here.
es: Ejecuta una transformación para verla aquí.
fr: Exécutez une transformation pour l'afficher ici.
ja: 変換を実行するとここに表示されます。
zh_hans: 运行转换后会显示在这里。

source: Save
es: Guardar
fr: Enregistrer
ja: 保存
zh_hans: 保存

source: Select a preset and run transform.
es: Selecciona un ajuste predefinido y ejecuta la transformación.
fr: Sélectionnez un préréglage puis lancez la transformation.
ja: プリセットを選択して変換を実行してください。
zh_hans: 选择预设并运行转换。

source: Select an image to decode.
es: Selecciona una imagen para decodificar.
fr: Sélectionnez une image à décoder.
ja: デコードする画像を選択してください。
zh_hans: 选择要解码的图像。

source: Select image
es: Seleccionar imagen
fr: Sélectionner une image
ja: 画像を選択
zh_hans: 选择图像

source: Settings
es: Ajustes
fr: Paramètres
ja: 設定
zh_hans: 设置

source: Source
es: Origen
ja: ソース
zh_hans: 源

source: Source not set
es: Origen no establecido
fr: Source non définie
ja: ソース未設定
zh_hans: 源未设置

source: Source text
es: Texto de origen
fr: Texte source
ja: ソーステキスト
zh_hans: 源文本

source: Source text not retained.
es: El texto de origen no se conservó.
fr: Le texte source n'a pas été conservé.
ja: 元のテキストは保存されていません。
zh_hans: 源文本未保留。

source: Status
es: Estado
fr: Statut
ja: 状態
zh_hans: 状态

source: Stored mappings: %lld
es: Mapeos guardados: %lld
fr: Correspondances enregistrées : %lld
ja: 保存済みマッピング: %lld
zh_hans: 已保存映射：%lld

source: Subscription
es: Suscripción
fr: Abonnement
ja: サブスクリプション
zh_hans: 订阅

source: Tags are not set
es: Las etiquetas no están configuradas
fr: Les tags ne sont pas définis
ja: タグは設定されていません
zh_hans: 标签未设置

source: Target
es: Objetivo
fr: Cible
ja: ターゲット
zh_hans: 目标

source: Target not set
es: Objetivo no establecido
fr: Cible non définie
ja: ターゲット未設定
zh_hans: 目标未设置

source: Target text
es: Texto de destino
fr: Texte cible
ja: ターゲットテキスト
zh_hans: 目标文本

source: This action cannot be undone.
es: Esta acción no se puede deshacer.
fr: Cette action est irréversible.
ja: この操作は取り消せません。
zh_hans: 此操作无法撤销。

source: Transform & Save
es: Transformar y guardar
fr: Transformer et enregistrer
ja: 変換して保存
zh_hans: 转换并保存

source: Transform failed
es: La transformación falló
fr: La transformation a échoué
ja: 変換に失敗しました
zh_hans: 转换失败

source: Transforms
es: Transformaciones
fr: Transformations
ja: 変換
zh_hans: 转换

source: Updated: %d
es: Actualizados: %d
fr: Mis à jour : %d
ja: 更新: %d
zh_hans: 已更新：%d

source: Use iCloud sync
es: Usar la sincronización de iCloud
fr: Utiliser la synchronisation iCloud
ja: iCloud同期を使用
zh_hans: 使用 iCloud 同步

source: Error
fr: Erreur
ja: エラー
zh_hans: 错误

source: Total: %d
ja: 合計: %d
zh_hans: 总计：%d
